docs/deshittification.tex
% Created 2025-10-12 Sun 08:57
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{graphicx}
\author{David Joseph}
\date{\today}
\title{How We Compete With the Big Enshittifiers}
\hypersetup{
 pdfauthor={David Joseph},
 pdftitle={How We Compete With the Big Enshittifiers},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{The one-minute version}
\label{sec:org4df8a0a}
Most platforms get worse over time: they squeeze users, hide the good stuff, and sell your attention.  
We flip that: \textbf{every important claim becomes a promise with proof}. If someone says “I’ll do X by Y,”
we lock the terms, collect neutral evidence, and show \textbf{Kept / Missed} with receipts.
Good actors rise because they actually keep promises; bad actors can’t hide.
\section*{What’s different under the hood}
\label{sec:orgab462b4}
\begin{itemize}
\item \textbf{\textbf{ABDUCTIO (decision engine):}} Before you act, it asks “What little bit of evidence is worth paying for next?”
That saves time and money and avoids hype.
\item \textbf{\textbf{SPONSIO (promise engine):}} After you act, independent assessors verify results against the frozen rules.
No moving goalposts, no vague stars.
\item \textbf{\textbf{Merit is domain-specific:}} Great at \emph{coding/frontend} doesn’t auto-make you great at \emph{legal/contracts}.
\item \textbf{\textbf{Open audit trail:}} Cryptographic receipts prove \textbf{who said what, when}, and what evidence was checked.
\end{itemize}
\section*{Dual-track money model (safe today, powerful later)}
\label{sec:org26b72f8}
\begin{itemize}
\item \textbf{\textbf{Track A — Marketplace Lite (now):}} Real money runs through normal card payments (auth→capture),
with optional deposits. We \textbf{don’t} hold balances or run wallets.
\item \textbf{\textbf{Track B — Service Credits (issuer-only):}} You can buy packs that pay for \textbf{our own} platform evaluations
(e.g., an ABDUCTIO decision pack). They aren’t transferable or cash-outable.
\item Later, when we have volume + approvals, both tracks can graduate to fully staked/escrowed promises
with a licensed payments partner.
\end{itemize}
\section*{The gated snowball (how we scale without big capital)}
\label{sec:orgfea9a4b}
\begin{enumerate}
\item \textbf{\textbf{Gate 1 — Simple, low-risk jobs (e.g., coaching reliability):}}
Prove speed + fairness. Publish honest stats (on-time \%, coverage, disputes).
\item \textbf{\textbf{Gate 2 — Higher-stakes reviews (e.g., loan/grant screens):}}
Show our scores predict outcomes better than status quo. Keep audit trails clean.
\item \textbf{\textbf{Gate 3 — Institutional programs (state banks, agencies):}}
Integrate, standardize, and publish program dashboards.
\item \textbf{\textbf{Gate 4 — National templates \& licensing:}}
Become the default method; build a big outcome dataset.
\item \textbf{\textbf{Gate 5 — Enterprise AI audits:}}
Map to regulations, verify real-world performance.
\item \textbf{\textbf{Gate 6 — Expert marketplace (with assessments):}}
Route the best experts/agents; pay per verified result.
\item \textbf{\textbf{Gate 7 — Cross-domain trust infra:}}
Open APIs so other platforms can plug in our “promise + proof” rails.
\end{enumerate}
\section*{Why this can beat enshittification}
\label{sec:orge52f2c1}
\begin{itemize}
\item \textbf{\textbf{Costs trend down, quality trends up:}} ABDUCTIO buys only the evidence that matters.
\item \textbf{\textbf{No hidden “rank tax”:}} Placement comes from kept promises + transparent coverage, not pay-to-play.
\item \textbf{\textbf{Proof travels:}} Your kept-promise record is portable (by domain), so platforms must treat you fairly.
\item \textbf{\textbf{User control \& privacy by default:}} We publish \textbf{minimal} public receipts (month | standard | kept/missed),
not your personal data or exact timestamps.
\end{itemize}
\section*{What you’ll notice as a user}
\label{sec:org0b164d7}
\begin{itemize}
\item \textbf{Clear tiles:} “Kept / Missed / Renegotiated,” with confidence labels and sample size.
\item \textbf{Fast resolution:} Simple deposits + rules → quick refunds or captures; no endless tickets.
\item \textbf{Honest small-n:} We show confidence bands and “limited data” badges instead of faking certainty.
\item \textbf{Appeals that work:} Independent rotation + evidence checks; overturned calls are documented.
\end{itemize}
\section*{Why it’s hard for the big guys to copy}
\label{sec:org7a5b4c9}
\begin{itemize}
\item \textbf{\textbf{Outcome dataset moat:}} Years of paired “promise→result” data you can’t buy off the shelf.
\item \textbf{\textbf{Co-op incentives:}} Builders and assessors earn ownership via verified contributions,
which BigCo can’t easily match with ad dollars.
\item \textbf{\textbf{Standards first:}} We anchor to regulations and program rules; ripping us out creates audit risk.
\end{itemize}
\section*{What could go wrong (and how we handle it)}
\label{sec:orga48f14a}
\begin{itemize}
\item \textbf{People try to game the rules:} We rotate assessors, cap influence, and check source overlap.
\item \textbf{Early data is noisy:} We show Wilson lower bounds and require minimum coverage before ranking.
\item \textbf{Money gets messy:} We keep funds on standard rails now; add licensed escrow only when ready.
\end{itemize}
\section*{Bottom line}
\label{sec:org63b589f}
We replace “trust us” with \textbf{“show me.”}  
Every step earns the right to the next gate. Quality compounds. Bad behavior can’t hide.  
That’s how you out-compete enshittification—by making honest work the easiest way to win.
\end{document}
